#pragma once

#include "Unknown/UnkStruct_ov000_020b5300.hpp"
#include "global.h"
#include "types.h"

class UnkStruct_ov000_020b5340 {
public:
    /* 00 */ UnkStruct_ov000_020b5300 *mUnk_00;
    /* 04 */ unk8 mUnk_04;
    /* 05 */ unk8 mUnk_05;
    /* 06 */ unk8 mUnk_06;
    /* 07 */ unk8 mUnk_07;
    /* 08 */ unk32 mUnk_08;
    /* 0C */ unk32 mUnk_0C;
    /* 10 */ unk32 mUnk_10;
    /* 14 */ unk32 mUnk_14;
    /* 18 */ unk32 mUnk_18;
    /* 1C */ unk32 mUnk_1C;
    /* 20 */ unk32 mUnk_20;
    /* 24 */ unk32 mUnk_24;
    /* 28 */ unk32 mUnk_28;
    /* 2C */ unk32 mUnk_2C;

    UnkStruct_ov000_020b5340();
    ~UnkStruct_ov000_020b5340();

    void func_ov000_0206ffc0();

    void func_ov018_020c57fc();
};

extern UnkStruct_ov000_020b5340 data_ov000_020b5340;
