#pragma once

#include "global.h"
#include "types.h"

class UnkStruct_027e0cf8 {
public:
    /* 00 */ unk32 mUnk_00;
    /* 00 */ unk32 mUnk_04;
    /* 00 */ unk32 mUnk_08;
    /* 00 */ unk32 mUnk_0C;
    /* 00 */ unk32 mUnk_10;
    /* 00 */ unk32 mUnk_14;
    /* 00 */ unk32 mUnk_18;
    /* 00 */ bool mUnk_1C;

    UnkStruct_027e0cf8();
    ~UnkStruct_027e0cf8();

    void func_ov024_020c755c(void *param1);
    void func_ov024_020c7724();
    void func_ov024_020c7780();
    void func_ov024_020c77b0(unk32 param1);
    void func_ov024_020c7828(unk32 param1);
    void func_ov024_020c77d0();
};

extern UnkStruct_027e0cf8 *data_027e0cf8;
