#pragma once

#include "global.h"
#include "types.h"

class UnkStruct_ov000_020b5300 {
public:
    /* 00 */ unk32 mUnk_00;
    /* 04 */ unk32 mUnk_04;
    /* 08 */ unk32 mUnk_08;
    /* 0C */ unk32 mUnk_0C;
    /* 10 */ unk32 mUnk_10;
    /* 14 */ unk32 mUnk_14;
    /* 18 */ unk32 mUnk_18;
    /* 1C */ unk32 mUnk_1C;
    /* 20 */ unk16 mUnk_20;
    /* 20 */ unk16 mUnk_22;
    /* 24 */ unk32 mUnk_24;
    /* 28 */ unk8 mUnk_28;
    /* 29 */ unk8 mUnk_29;
    /* 29 */ unk8 mUnk_2A;
    /* 29 */ unk8 mUnk_2B;
    /* 2C */ unk32 mUnk_2C;
    /* 30 */ unk32 mUnk_30;
    /* 34 */ unk32 mUnk_34;

    UnkStruct_ov000_020b5300();
    ~UnkStruct_ov000_020b5300();

    void func_ov018_020c583c(unk32 param1);
};

extern UnkStruct_ov000_020b5300 data_ov000_020b5300;
