#pragma once

#include "global.h"
#include "types.h"

class UnkStruct_ov000_020b52b4 {
public:
    /* 00 */ unk32 mUnk_00;
    /* 04 */ unk32 mUnk_04;
    /* 08 */ unk32 mUnk_08;
    /* 0C */ unk32 mUnk_0C;
    /* 10 */ unk32 mUnk_10;
    /* 10 */ unk32 mUnk_14;
    /* 18 */ unk32 mUnk_18;
    /* 1C */ unk32 mUnk_1C;
    /* 20 */ unk32 mUnk_20;

    UnkStruct_ov000_020b52b4();
    ~UnkStruct_ov000_020b52b4();

    void func_ov000_0206f6ac();
};

extern UnkStruct_ov000_020b52b4 data_ov000_020b52b4;
